/*
 * Copyright 2001 MontaVista Software Inc.
 * Author: jsun@mvista.com or jsun@junsun.net
 *
 * driver/net/nec_candy.c
 *     NEC candy ether driver.  
 *
 * This program is free software; you can redistribute  it and/or modify it
 * under  the terms of  the GNU General  Public License as published by the
 * Free Software Foundation;  either version 2 of the  License, or (at your
 * option) any later version.
 */

#include <linux/init.h>
#include <linux/types.h>
#include <linux/kernel.h>		/* get_options(), printk(), panic().. */
#include <linux/module.h>
#include <linux/delay.h>
#include <linux/netdevice.h>
#include <linux/param.h>		/* for HZ */
#include <linux/etherdevice.h>		/* init_etherdev() */
#include <linux/if.h>
#include <linux/spinlock.h>

#include <asm/addrspace.h>		/* KSEGx() */
#include <asm/irq.h>			/* NR_IRQS */
#include <asm/io.h>			/* virt_to_phys(), dma_cache_xx() */

/***********************************************************************
 * debug
 ***********************************************************************
 */

#define		DEBUG_NEC_CANDY
// #define		DEBUG_VERBOSE_NEC_CANDY
// #define	SHOW_BUG		/* targeted bug reporting msgs */

#ifdef DEBUG_VERBOSE_NEC_CANDY
#define DEBUG_NEC_CANDY
#endif

#ifdef DEBUG_NEC_CANDY

#define ASSERT(x) if (!(x)) { panic("%s:%d - assert failed!\n", __FILE__, __LINE__); }
#define VERIFY(x, y) ASSERT(x y)
#define DEBUG(x)  do { x; } while (0)

#else

#define ASSERT(x)
#define VERIFY(x, y) x
#define DEBUG(x)

#endif


/* Transmit Status bit definition in Transmit Descriptor                     */
/*---------------------------------------------------------------------------*/
#define DBRE        0x1000          /* Data Buffer Read Error                */
#define TUDR        0x0800          /* Transmit Underrun Error               */
#define CSE         0x0400          /* Carrier Sense Lost Error              */
#define LCOL        0x0200          /* Late Collision                        */
#define ECOL        0x0100          /* Excessive Collision                   */
#define EDFR        0x0080          /* Excessive Deferral                    */
#define TGNT        0x0004          /* Transmit Giant Frame                  */
#define HBF         0x0002          /* Heart Beat Fail for ENDEC mode        */
#define TOK         0x0001          /* Transmit OK                           */
/*---------------------------------------------------------------------------*/
/* Receive Status bit definition in Receive Descriptor                       */
/*---------------------------------------------------------------------------*/
#define DBWE        0x1000          /* Data Buffer Write Error               */
#define FTYP_MASK   0x0e00          /* Frame Type                            */
 #define    BCASTF      0x0000      /* Broadcast Frame                       */
 #define    MCASTF      0x0200      /* Multicast Frame                       */
 #define    UCASTF      0x0400      /* Unicast Frame                         */
 #define    VLANF       0x0600      /* VLAN Frame                            */
 #define    PAUSEF      0x0800      /* PAUSE control Frame                   */
 #define    CTLF        0x0a00      /* Control Frame                         */
#define OVRN        0x0100          /* Overrun Error                         */
#define RUNT        0x0080          /* Runt packet                           */
#define FRGE        0x0040          /* Fragment Error                        */
#define RCV         0x0020          /* Detects RXER                          */
#define FC          0x0010          /* False Carrier                         */
#define CRCE        0x0008          /* CRC Error                             */
#define FAE         0x0004          /* Frame Alignment Error                 */
#define RFLE        0x0002          /* Receive Frame Length Error            */
#define RXOK        0x0001          /* Receive OK                            */

/*---------------------------------------------------------------------------*/
/* media type selection                                                      */
/*---------------------------------------------------------------------------*/
enum mediatype { MEDIA_AUTO, MEDIA_10_HALF, MEDIA_10_FULL, MEDIA_100_HALF, MEDIA_100_FULL };

/***********************************************************************
 * data structure
 ***********************************************************************
 */
typedef volatile struct {
    ulong  macc1;       /* 0x00     MAC configuration register 1             */
    ulong  macc2;       /* 0x04     MAC configuration register 2             */
    ulong  ipgt;        /* 0x08     Back-to-Back IPG register                */
    ulong  ipgr;        /* 0x0c     Non Back-to-Back IPG register            */
    ulong  clrt;        /* 0x10     Collision register*/
    ulong  lmax;        /* 0x14     Max packet length register               */
    ulong  reserved0[2];
    ulong  retx;        /* 0x20     Retry count register                     */
    ulong  reserved1[12];
    ulong  lsa2;        /* 0x54     Station Address register 2               */
    ulong  lsa1;        /* 0x58     Station Address register 1               */
    ulong  ptvr;        /* 0x5c     Pause timer value read register          */
    ulong  reserved2[1];
    ulong  vltp;        /* 0x64     VLAN type register                       */
    ulong  reserved3[6];
    ulong  miic;        /* 0x80     MII configuration register               */
    ulong  reserved4[4];
    ulong  mcmd;        /* 0x94     MII command register                     */
    ulong  madr;        /* 0x98     MII address register                     */
    ulong  mwtd;        /* 0x9c     MII write data register                  */
    ulong  mrdd;        /* 0xa0     MII read data register                   */
    ulong  mind;        /* 0xa4     MII indicator register                   */
    ulong  reserved5[6];
    ulong  stlc;        /* 0xc0     Statistics counter configuration register*/
    ulong  reserved6[1];
    ulong  afr;         /* 0xc8     Address filter register                  */
    ulong  ht1;         /* 0xcc     Hash table register 1                    */
    ulong  ht2;         /* 0xd0     Hash table register 2                    */
    ulong  reserved7[2];
    ulong  car1;        /* 0xdc     Carry register 1                         */
    ulong  car2;        /* 0xe0     Carry register 2                         */
    ulong  reserved8[19];
    ulong  cam1;        /* 0x130    Carry mask register 1                    */
    ulong  cam2;        /* 0x134    Carry mask register 2                    */
    ulong  reserved9[2];

    /* RX Statistics Counter */
    ulong  rbyt;        /* 0x140    Receive Byte Counter                     */
    ulong  rpkt;        /* 0x144    Receive Packet Counter                   */
    ulong  rfcs;        /* 0x148    Receive FCS Error Counter                */
    ulong  rmca;        /* 0x14c    Receive Multicast Packet Counter         */
    ulong  rbca;        /* 0x150    Receive Broadcast Packet Counter         */
    ulong  rxcf;        /* 0x154    Receive Control Frame Packet Counter     */
    ulong  rxpf;        /* 0x158    Receive PAUSE Frame Packet Counter       */
    ulong  rxuo;        /* 0x15c    Receive Unknown OP code Counter          */
    ulong  raln;        /* 0x160    Receive Alignment Error Counter          */
    ulong  rflr;        /* 0x164    Receive Frame Length Out of Range Counter*/
    ulong  rcde;        /* 0x168    Receive Code Error Counter               */
    ulong  rfcr;        /* 0x16c    Receive False Carrier Counter            */
    ulong  rund;        /* 0x170    Receive Undersize Packet Counter         */
    ulong  rovr;        /* 0x174    Receive Oversize Packet Counter          */
    ulong  rfrg;        /* 0x178    Receive Error Undersize Packet Counter   */
    ulong  rjbr;        /* 0x17c    Receive Error Oversize Packet Counter    */
    ulong  r64;         /* 0x180    Receive 64 Byte Frame Counter            */
    ulong  r127;        /* 0x184    Receive 65 to 127 Byte Frame Counter     */
    ulong  r255;        /* 0x188    Receive 128 to 255 Byte Frame Counter    */
    ulong  r511;        /* 0x18c    Receive 256 to 511 Byte Frame Counter    */
    ulong  r1k;         /* 0x190    Receive 512 to 1023 Byte Frame Counter   */
    ulong  rmax;        /* 0x194    Receive Over 1023 Byte Frame Counter     */
    ulong  rvbt;        /* 0x198    Receive Valid Byte Counter               */
    ulong  reserved10[9];

    /* Tx Statistics Counter */
    ulong  tbyt;        /* 0x1c0    Transmit Byte Counter                    */
    ulong  tpct;        /* 0x1c4    Transmit Packet Counter                  */
    ulong  tfcs;        /* 0x1c8    Transmit CRC Error Packet Counter        */
    ulong  tmca;        /* 0x1cc    Transmit Multicast Packet Counter        */
    ulong  tbca;        /* 0x1d0    Transmit Broadcast Packet Counter        */
    ulong  tuca;        /* 0x1d4    Transmit Unicast Packet Counter          */
    ulong  txpf;        /* 0x1d8    Transmit PAUSE control Frame Counter     */
    ulong  tdfr;        /* 0x1dc    Transmit Single Deferral Packet Counter  */
    ulong  txdf;        /* 0x1e0    Transmit Excessive Deferral Packet Counter  */
    ulong  tscl;        /* 0x1e4    Transmit Single Collision Packet Counter    */
    ulong  tmcl;        /* 0x1e8    Transmit Multiple collision Packet Counter  */
    ulong  tlcl;        /* 0x1ec    Transmit Late Collision Packet Counter      */
    ulong  txcl;        /* 0x1f0    Transmit Excessive Collision Packet Counter */
    ulong  tncl;        /* 0x1f4    Transmit Total Collision Counter         */
    ulong  tcse;        /* 0x1f8    Transmit Carrier Sense Error Counter     */
    ulong  time;        /* 0x1fc    Transmit Internal MAC Error Counter      */

/*---------------------------------------------------------------------------*/
/* Candy DMA and FiFo Management registers                                   */
/*---------------------------------------------------------------------------*/
    ulong  txcfg;       /* 0x200    Transmit Configuration                   */
    ulong  txfc;        /* 0x204    Transmit FiFo Control                    */
    ulong  txd;         /* 0x208    Transmit Data                            */
    ulong  txst;        /* 0x20c    Transmit Status                          */
    ulong  txfap;       /* 0x210    TX FiFo access pointer                   */
    ulong  txdp;        /* 0x214    Transmit Descriptor Pointer              */
    ulong  rxcfg;       /* 0x218    Receive Configuration                    */
    ulong  rxfc;        /* 0x21c    Receive FiFo Control                     */
    ulong  rxd;         /* 0x220    Receive Data                             */
    ulong  rxst;        /* 0x224    Receive Status                           */
    ulong  rxfap;       /* 0x228    RX FiFo access pointer                   */
    ulong  rxdp;        /* 0x22c    Receive Descriptor Pointer               */
    ulong  rxpd;        /* 0x230    Receive Pool Descriptor                  */

/*---------------------------------------------------------------------------*/
/* Candy Interrupt and Configuratioin registers                              */
/*---------------------------------------------------------------------------*/
    ulong  ccr;         /* 0x234    CANDY Configuration Read/Write register  */
    ulong  isr;         /* 0x238    Interrupt Serves register                */
    ulong  msr;         /* 0x23c    Mask Serves register                     */
} candy_regs;


/*
 * descriptor structure
 */
struct candy_desc {
	ushort		size;
	ushort		status;
	ulong		pointer;
};

/*
 * private data structure for candy driver.
 */
struct candy_private {
	struct candy_desc 	*tx_ring;
	struct sk_buff 		*tx_skb[TX_RING_SIZE];

	struct candy_desc 	*rx_ring;
	struct sk_buff 		*rx_skb[RX_RING_SIZE];
	int			rx_disable;

	uint			rx_head;
	uint			tx_head, tx_stop, tx_tail;
	int			tx_count;

	struct net_device_stats stats;

	spinlock_t		lock;

	/* MII status */
	uint			mii_fullduplex:1;
	uint			mii_speed100:1;
	uint			mii_linkOK:1;

	/* hardware related */
	ulong			pmd_addr;
	candy_regs		*regs;

	/* house keeping */
	struct net_device *	dev;
	struct candy_private* 	next;
};

/***********************************************************************
 * global data
 ***********************************************************************
 */

